; domain
;;Created by Tomas de la Rosa
;;Domain for painting floor tiles with two colors

(define (domain floor-tile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates 	
		(robot-at ?r - robot ?x - tile)
		(up ?x - tile ?y - tile)
		(down ?x - tile ?y - tile)
		(right ?x - tile ?y - tile)
		(left ?x - tile ?y - tile)
		
		(clear ?x - tile)
                (painted ?x - tile ?c - color)
		(robot-has ?r - robot ?c - color)
                (available-color ?c - color)
                (free-color ?r - robot))

(:functions (total-cost))

(:action change-color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
               (increase (total-cost) 5))
) 


(:action paint-up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
               (increase (total-cost) 2))
)


(:action paint-down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c)
(increase (total-cost) 2))
)


; Robot movements
(:action up 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 3))
)


(:action down 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

(:action right 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
	       (increase (total-cost) 1))
)

(:action left 
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y))
               (increase (total-cost) 1))
)

)

; problem
(define (problem name)
 (:domain floor-tile)
 (:objects tile_0-1 tile_0-2 tile_0-3 tile_0-4 
           tile_1-1 tile_1-2 tile_1-3 tile_1-4 
           tile_2-1 tile_2-2 tile_2-3 tile_2-4 
           tile_3-1 tile_3-2 tile_3-3 tile_3-4 
           tile_4-1 tile_4-2 tile_4-3 tile_4-4 - tile
           robot1 robot2 robot3 - robot
           white black - color
)
 (:init 
   (= (total-cost) 0)
   (robot-at robot1 tile_1-2)
   (robot-has robot1 white)
   (robot-at robot2 tile_3-3)
   (robot-has robot2 black)
   (robot-at robot3 tile_3-4)
   (robot-has robot3 white)
   (available-color white)
   (available-color black)
   (clear tile_0-1)
   (clear tile_0-2)
   (clear tile_0-3)
   (clear tile_0-4)
   (clear tile_1-1)
   (clear tile_1-3)
   (clear tile_1-4)
   (clear tile_2-1)
   (clear tile_2-2)
   (clear tile_2-3)
   (clear tile_2-4)
   (clear tile_3-1)
   (clear tile_3-2)
   (clear tile_4-1)
   (clear tile_4-2)
   (clear tile_4-3)
   (clear tile_4-4)
   (up tile_1-1 tile_0-1)
   (up tile_1-2 tile_0-2)
   (up tile_1-3 tile_0-3)
   (up tile_1-4 tile_0-4)
   (up tile_2-1 tile_1-1)
   (up tile_2-2 tile_1-2)
   (up tile_2-3 tile_1-3)
   (up tile_2-4 tile_1-4)
   (up tile_3-1 tile_2-1)
   (up tile_3-2 tile_2-2)
   (up tile_3-3 tile_2-3)
   (up tile_3-4 tile_2-4)
   (up tile_4-1 tile_3-1)
   (up tile_4-2 tile_3-2)
   (up tile_4-3 tile_3-3)
   (up tile_4-4 tile_3-4)
   (down tile_0-1 tile_1-1)
   (down tile_0-2 tile_1-2)
   (down tile_0-3 tile_1-3)
   (down tile_0-4 tile_1-4)
   (down tile_1-1 tile_2-1)
   (down tile_1-2 tile_2-2)
   (down tile_1-3 tile_2-3)
   (down tile_1-4 tile_2-4)
   (down tile_2-1 tile_3-1)
   (down tile_2-2 tile_3-2)
   (down tile_2-3 tile_3-3)
   (down tile_2-4 tile_3-4)
   (down tile_3-1 tile_4-1)
   (down tile_3-2 tile_4-2)
   (down tile_3-3 tile_4-3)
   (down tile_3-4 tile_4-4)
   (right tile_0-2 tile_0-1)
   (right tile_0-3 tile_0-2)
   (right tile_0-4 tile_0-3)
   (right tile_1-2 tile_1-1)
   (right tile_1-3 tile_1-2)
   (right tile_1-4 tile_1-3)
   (right tile_2-2 tile_2-1)
   (right tile_2-3 tile_2-2)
   (right tile_2-4 tile_2-3)
   (right tile_3-2 tile_3-1)
   (right tile_3-3 tile_3-2)
   (right tile_3-4 tile_3-3)
   (right tile_4-2 tile_4-1)
   (right tile_4-3 tile_4-2)
   (right tile_4-4 tile_4-3)
   (left tile_0-1 tile_0-2)
   (left tile_0-2 tile_0-3)
   (left tile_0-3 tile_0-4)
   (left tile_1-1 tile_1-2)
   (left tile_1-2 tile_1-3)
   (left tile_1-3 tile_1-4)
   (left tile_2-1 tile_2-2)
   (left tile_2-2 tile_2-3)
   (left tile_2-3 tile_2-4)
   (left tile_3-1 tile_3-2)
   (left tile_3-2 tile_3-3)
   (left tile_3-3 tile_3-4)
   (left tile_4-1 tile_4-2)
   (left tile_4-2 tile_4-3)
   (left tile_4-3 tile_4-4)
)
 (:goal (and
    (painted tile_1-1 white)
    (painted tile_1-2 black)
    (painted tile_1-3 white)
    (painted tile_1-4 black)
    (painted tile_2-1 black)
    (painted tile_2-2 white)
    (painted tile_2-3 black)
    (painted tile_2-4 white)
    (painted tile_3-1 white)
    (painted tile_3-2 black)
    (painted tile_3-3 white)
    (painted tile_3-4 black)
    (painted tile_4-1 black)
    (painted tile_4-2 white)
    (painted tile_4-3 black)
    (painted tile_4-4 white)
))
 (:metric minimize (total-cost))
)

; plan
1. (paint-up robot3 tile_4-4 tile_3-4 white)
   deleted: (clear tile_4-4)
   added: (painted tile_4-4 white)
   goals met: 1 of 16
2. (paint-up robot2 tile_4-3 tile_3-3 black)
   deleted: (clear tile_4-3)
   added: (painted tile_4-3 black)
   goals met: 2 of 16
3. (left robot2 tile_3-3 tile_3-2)
   deleted: (robot-at robot2 tile_3-3) (clear tile_3-2)
   added: (robot-at robot2 tile_3-2) (clear tile_3-3)
   goals met: 2 of 16
4. (left robot3 tile_3-4 tile_3-3)
   deleted: (robot-at robot3 tile_3-4) (clear tile_3-3)
   added: (robot-at robot3 tile_3-3) (clear tile_3-4)
   goals met: 2 of 16
5. (left robot2 tile_3-2 tile_3-1)
   deleted: (robot-at robot2 tile_3-2) (clear tile_3-1)
   added: (robot-at robot2 tile_3-1) (clear tile_3-2)
   goals met: 2 of 16
6. (left robot3 tile_3-3 tile_3-2)
   deleted: (robot-at robot3 tile_3-3) (clear tile_3-2)
   added: (robot-at robot3 tile_3-2) (clear tile_3-3)
   goals met: 2 of 16
7. (paint-up robot3 tile_4-2 tile_3-2 white)
   deleted: (clear tile_4-2)
   added: (painted tile_4-2 white)
   goals met: 3 of 16
8. (down robot3 tile_3-2 tile_2-2)
   deleted: (robot-at robot3 tile_3-2) (clear tile_2-2)
   added: (robot-at robot3 tile_2-2) (clear tile_3-2)
   goals met: 3 of 16
9. (change-color robot3 white black)
   deleted: (robot-has robot3 white)
   added: (robot-has robot3 black)
   goals met: 3 of 16
10. (paint-up robot3 tile_3-2 tile_2-2 black)
   deleted: (clear tile_3-2)
   added: (painted tile_3-2 black)
   goals met: 4 of 16
11. (right robot3 tile_2-2 tile_2-3)
   deleted: (robot-at robot3 tile_2-2) (clear tile_2-3)
   added: (robot-at robot3 tile_2-3) (clear tile_2-2)
   goals met: 4 of 16
12. (paint-up robot1 tile_2-2 tile_1-2 white)
   deleted: (clear tile_2-2)
   added: (painted tile_2-2 white)
   goals met: 5 of 16
13. (down robot1 tile_1-2 tile_0-2)
   deleted: (robot-at robot1 tile_1-2) (clear tile_0-2)
   added: (robot-at robot1 tile_0-2) (clear tile_1-2)
   goals met: 5 of 16
14. (change-color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 5 of 16
15. (paint-up robot1 tile_1-2 tile_0-2 black)
   deleted: (clear tile_1-2)
   added: (painted tile_1-2 black)
   goals met: 6 of 16
16. (right robot1 tile_0-2 tile_0-3)
   deleted: (robot-at robot1 tile_0-2) (clear tile_0-3)
   added: (robot-at robot1 tile_0-3) (clear tile_0-2)
   goals met: 6 of 16
17. (paint-up robot2 tile_4-1 tile_3-1 black)
   deleted: (clear tile_4-1)
   added: (painted tile_4-1 black)
   goals met: 7 of 16
18. (down robot2 tile_3-1 tile_2-1)
   deleted: (robot-at robot2 tile_3-1) (clear tile_2-1)
   added: (robot-at robot2 tile_2-1) (clear tile_3-1)
   goals met: 7 of 16
19. (change-color robot3 black white)
   deleted: (robot-has robot3 black)
   added: (robot-has robot3 white)
   goals met: 7 of 16
20. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 7 of 16
21. (change-color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 7 of 16
22. (paint-up robot2 tile_3-1 tile_2-1 white)
   deleted: (clear tile_3-1)
   added: (painted tile_3-1 white)
   goals met: 8 of 16
23. (change-color robot2 white black)
   deleted: (robot-has robot2 white)
   added: (robot-has robot2 black)
   goals met: 8 of 16
24. (down robot2 tile_2-1 tile_1-1)
   deleted: (robot-at robot2 tile_2-1) (clear tile_1-1)
   added: (robot-at robot2 tile_1-1) (clear tile_2-1)
   goals met: 8 of 16
25. (paint-up robot2 tile_2-1 tile_1-1 black)
   deleted: (clear tile_2-1)
   added: (painted tile_2-1 black)
   goals met: 9 of 16
26. (change-color robot2 black white)
   deleted: (robot-has robot2 black)
   added: (robot-has robot2 white)
   goals met: 9 of 16
27. (down robot2 tile_1-1 tile_0-1)
   deleted: (robot-at robot2 tile_1-1) (clear tile_0-1)
   added: (robot-at robot2 tile_0-1) (clear tile_1-1)
   goals met: 9 of 16
28. (paint-up robot2 tile_1-1 tile_0-1 white)
   deleted: (clear tile_1-1)
   added: (painted tile_1-1 white)
   goals met: 10 of 16
29. (paint-up robot3 tile_3-3 tile_2-3 white)
   deleted: (clear tile_3-3)
   added: (painted tile_3-3 white)
   goals met: 11 of 16
30. (change-color robot3 white black)
   deleted: (robot-has robot3 white)
   added: (robot-has robot3 black)
   goals met: 11 of 16
31. (down robot3 tile_2-3 tile_1-3)
   deleted: (robot-at robot3 tile_2-3) (clear tile_1-3)
   added: (robot-at robot3 tile_1-3) (clear tile_2-3)
   goals met: 11 of 16
32. (paint-up robot3 tile_2-3 tile_1-3 black)
   deleted: (clear tile_2-3)
   added: (painted tile_2-3 black)
   goals met: 12 of 16
33. (right robot3 tile_1-3 tile_1-4)
   deleted: (robot-at robot3 tile_1-3) (clear tile_1-4)
   added: (robot-at robot3 tile_1-4) (clear tile_1-3)
   goals met: 12 of 16
34. (paint-up robot1 tile_1-3 tile_0-3 white)
   deleted: (clear tile_1-3)
   added: (painted tile_1-3 white)
   goals met: 13 of 16
35. (up robot3 tile_1-4 tile_2-4)
   deleted: (robot-at robot3 tile_1-4) (clear tile_2-4)
   added: (robot-at robot3 tile_2-4) (clear tile_1-4)
   goals met: 13 of 16
36. (paint-up robot3 tile_3-4 tile_2-4 black)
   deleted: (clear tile_3-4)
   added: (painted tile_3-4 black)
   goals met: 14 of 16
37. (change-color robot3 black white)
   deleted: (robot-has robot3 black)
   added: (robot-has robot3 white)
   goals met: 14 of 16
38. (down robot3 tile_2-4 tile_1-4)
   deleted: (robot-at robot3 tile_2-4) (clear tile_1-4)
   added: (robot-at robot3 tile_1-4) (clear tile_2-4)
   goals met: 14 of 16
39. (paint-up robot3 tile_2-4 tile_1-4 white)
   deleted: (clear tile_2-4)
   added: (painted tile_2-4 white)
   goals met: 15 of 16
40. (change-color robot3 white black)
   deleted: (robot-has robot3 white)
   added: (robot-has robot3 black)
   goals met: 15 of 16
41. (down robot3 tile_1-4 tile_0-4)
   deleted: (robot-at robot3 tile_1-4) (clear tile_0-4)
   added: (robot-at robot3 tile_0-4) (clear tile_1-4)
   goals met: 15 of 16
42. (paint-up robot3 tile_1-4 tile_0-4 black)
   deleted: (clear tile_1-4)
   added: (painted tile_1-4 black)
   goals met: 16 of 16
